Masmiseim36/nxpSDK/devices/MIMXRT758S/iar/startup_MIMXRT758S_cm33_core0.s
; -------------------------------------------------------------------------
;  @file:    startup_MIMXRT758S_cm33_core0.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            MIMXRT758S_cm33_core0
;  @version: 2.0
;  @date:    2024-5-28
;  @build:   b241121
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2024 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)
        SECTION RO:CODE:NOROOT(2)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

;;The vector table is not needed for initialization.
__iar_init$$done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
        DCD     0x180000 ;Image length
#else
        DCD     sfe(RO) - __vector_table ;Image length
#endif
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     __vector_table                                ;Image load address
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     Reserved16_IRQHandler                         ;Reserved interrupt 16
        DCD     UTICK0_IRQHandler                             ;Micro-tick Timer
        DCD     MRT0_IRQHandler                               ;MRT: Ored Interrupt request
        DCD     CTIMER0_IRQHandler                            ;CTIMER: Interrupt request
        DCD     CTIMER1_IRQHandler                            ;CTIMER: Interrupt request
        DCD     SCT0_IRQHandler                               ;SCT: Interrupt request
        DCD     CTIMER3_IRQHandler                            ;CTIMER: Interrupt request
        DCD     LP_FLEXCOMM0_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM1_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM2_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM3_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM4_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM5_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LPSPI14_IRQHandler                            ;LPSPI: Interrupt request
        DCD     LPI2C15_IRQHandler                            ;LPI2C: Interrupt request
        DCD     ADC_IRQHandler                                ;ADC0: Interrupt request
        DCD     SDADC_IRQHandler                              ;SDADC0: Interrupt request
        DCD     ACMP_IRQHandler                               ;ACMP: interrupt request
        DCD     PDM_EVENT_IRQHandler                          ;MIC: Interrupt request for read data or Error
        DCD     PDM_HWVAD_EVENT_IRQHandler                    ;MIC: Hardware Voice Activity Detector interrupt or error interrupt
        DCD     HYPERVISOR_IRQHandler                         ;SECURE: Compute domain P-Bus Hypervisor interrupt
        DCD     SECURE_VIOLATION_IRQHandler                   ;SECURE: Compute domain P-Bus Secure violation interrupt
        DCD     SENSE_HYPERVISOR_IRQHandler                   ;Sense domain Hypervisor interrupt
        DCD     SENSE_SECURE_VIOLATION_IRQHandler             ;Sense domain Secure violation interrupt
        DCD     MEDIA_HYPERVISOR_IRQHandler                   ;Media domain Hypervisor interrupt
        DCD     MEDIA_SECURE_VIOLATION_IRQHandler             ;Media domain Secure violation interrupt
        DCD     RTC0_ALARM_IRQHandler                         ;RTC: Alarm interrupt
        DCD     RTC0_IRQHandler                               ;RTC: wakeup interrupt to Compute domain
        DCD     Reserved44_IRQHandler                         ;Reserved interrupt
        DCD     MU0_A_IRQHandler                              ;MU0: MUA, CPU0 to HiFi1
        DCD     MU1_A_IRQHandler                              ;MU1: MUA, CPU0 to CPU1
        DCD     Reserved47_IRQHandler                         ;Reserved interrupt
        DCD     CTIMER2_IRQHandler                            ;CTIMER: Interrupt request
        DCD     CTIMER4_IRQHandler                            ;CTIMER: Interrupt request
        DCD     OS_EVENT_IRQHandler                           ;OSEVENT: Event timer CPU0 Wakeup/interrupt
        DCD     LP_FLEXCOMM6_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM7_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     USDHC0_IRQHandler                             ;USDHC: Interrupt request
        DCD     USDHC1_IRQHandler                             ;USDHC: Interrupt request
        DCD     I3C0_IRQHandler                               ;I3C: Interrupt Request
        DCD     USB0_IRQHandler                               ;USB: HSUSB Interrup request
        DCD     USB1_IRQHandler                               ;USB: eUSB Interrup request
        DCD     WDT0_IRQHandler                               ;WDT: Interrupt request
        DCD     WDT1_IRQHandler                               ;WDT: Interrupt request
        DCD     USBPHY0_IRQHandler                            ;HSUSBPHY: UTM interrupt request
        DCD     PUF_IRQHandler                                ;PUF: Interrupt Request
        DCD     Reserved62_IRQHandler                         ;xxx Interrupt 62
        DCD     LP_FLEXCOMM8_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM9_IRQHandler                       ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM10_IRQHandler                      ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM11_IRQHandler                      ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM12_IRQHandler                      ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM13_IRQHandler                      ;FLEXCOMM: Interrupt request
        DCD     LPSPI16_IRQHandler                            ;LPSPI: Interrupt request
        DCD     I3C1_IRQHandler                               ;I3C: Interrupt Request
        DCD     FLEXIO_IRQHandler                             ;FLEXIO: Interrupt request
        DCD     LCDIF_IRQHandler                              ;LCDIF: Interrupt request
        DCD     VGPU_IRQHandler                               ;VGPU: Interrupt from graphics core (Domain HCLK)
        DCD     MIPI_IRQHandler                               ;DSI: Interrupt request
        DCD     EDMA0_CH0_IRQHandler                          ;EDMA: Channel 0 interrupt
        DCD     EDMA0_CH1_IRQHandler                          ;EDMA: Channel 1 interrupt
        DCD     EDMA0_CH2_IRQHandler                          ;EDMA: Channel 2 interrupt
        DCD     EDMA0_CH3_IRQHandler                          ;EDMA: Channel 3 interrupt
        DCD     EDMA0_CH4_IRQHandler                          ;EDMA: Channel 4 interrupt
        DCD     EDMA0_CH5_IRQHandler                          ;EDMA: Channel 5 interrupt
        DCD     EDMA0_CH6_IRQHandler                          ;EDMA: Channel 6 interrupt
        DCD     EDMA0_CH7_IRQHandler                          ;EDMA: Channel 7 interrupt
        DCD     EDMA0_CH8_IRQHandler                          ;EDMA: Channel 8 interrupt
        DCD     EDMA0_CH9_IRQHandler                          ;EDMA: Channel 9 interrupt
        DCD     EDMA0_CH10_IRQHandler                         ;EDMA: Channel 10 interrupt
        DCD     EDMA0_CH11_IRQHandler                         ;EDMA: Channel 11 interrupt
        DCD     EDMA0_CH12_IRQHandler                         ;EDMA: Channel 12 interrupt
        DCD     EDMA0_CH13_IRQHandler                         ;EDMA: Channel 13 interrupt
        DCD     EDMA0_CH14_IRQHandler                         ;EDMA: Channel 14 interrupt
        DCD     EDMA0_CH15_IRQHandler                         ;EDMA: Channel 15 interrupt
        DCD     EDMA1_CH0_IRQHandler                          ;EDMA: Channel 0 interrupt
        DCD     EDMA1_CH1_IRQHandler                          ;EDMA: Channel 1 interrupt
        DCD     EDMA1_CH2_IRQHandler                          ;EDMA: Channel 2 interrupt
        DCD     EDMA1_CH3_IRQHandler                          ;EDMA: Channel 3 interrupt
        DCD     EDMA1_CH4_IRQHandler                          ;EDMA: Channel 4 interrupt
        DCD     EDMA1_CH5_IRQHandler                          ;EDMA: Channel 5 interrupt
        DCD     EDMA1_CH6_IRQHandler                          ;EDMA: Channel 6 interrupt
        DCD     EDMA1_CH7_IRQHandler                          ;EDMA: Channel 7 interrupt
        DCD     EDMA1_CH8_IRQHandler                          ;EDMA: Channel 8 interrupt
        DCD     EDMA1_CH9_IRQHandler                          ;EDMA: Channel 9 interrupt
        DCD     EDMA1_CH10_IRQHandler                         ;EDMA: Channel 10 interrupt
        DCD     EDMA1_CH11_IRQHandler                         ;EDMA: Channel 11 interrupt
        DCD     EDMA1_CH12_IRQHandler                         ;EDMA: Channel 12 interrupt
        DCD     EDMA1_CH13_IRQHandler                         ;EDMA: Channel 13 interrupt
        DCD     EDMA1_CH14_IRQHandler                         ;EDMA: Channel 14 interrupt
        DCD     EDMA1_CH15_IRQHandler                         ;EDMA: Channel 15 interrupt
        DCD     GPIO00_IRQHandler                             ;GPIO: Interupt request, channel 0
        DCD     GPIO01_IRQHandler                             ;GPIO: Interupt request, channel 1
        DCD     GPIO10_IRQHandler                             ;GPIO: Interupt request, channel 0
        DCD     GPIO11_IRQHandler                             ;GPIO: Interupt request, channel 1
        DCD     GPIO20_IRQHandler                             ;GPIO: Interupt request, channel 0
        DCD     GPIO21_IRQHandler                             ;GPIO: Interupt request, channel 1
        DCD     GPIO30_IRQHandler                             ;GPIO: Interupt request, channel 0
        DCD     GPIO31_IRQHandler                             ;GPIO: Interupt request, channel 1
        DCD     GPIO40_IRQHandler                             ;GPIO: Interupt request, channel 0
        DCD     GPIO41_IRQHandler                             ;GPIO: Interupt request, channel 1
        DCD     GPIO50_IRQHandler                             ;GPIO: Interupt request, channel 0
        DCD     GPIO51_IRQHandler                             ;GPIO: Interupt request, channel 1
        DCD     GPIO60_IRQHandler                             ;GPIO: Interupt request, channel 0
        DCD     GPIO61_IRQHandler                             ;GPIO: Interupt request, channel 1
        DCD     GPIO70_IRQHandler                             ;GPIO: Interupt request, channel 0
        DCD     GPIO71_IRQHandler                             ;GPIO: Interupt request, channel 1
        DCD     PIN_INT0_IRQHandler                           ;PINT: Interupt request 0
        DCD     PIN_INT1_IRQHandler                           ;PINT: Interupt request 1
        DCD     PIN_INT2_IRQHandler                           ;PINT: Interupt request 2
        DCD     PIN_INT3_IRQHandler                           ;PINT: Interupt request 3
        DCD     PIN_INT4_IRQHandler                           ;PINT: Interupt request 4
        DCD     PIN_INT5_IRQHandler                           ;PINT: Interupt request 5
        DCD     PIN_INT6_IRQHandler                           ;PINT: Interupt request 6
        DCD     PIN_INT7_IRQHandler                           ;PINT: Interupt request 7
        DCD     SAI0_IRQHandler                               ;SAI: TX/RX interrupt
        DCD     SAI1_IRQHandler                               ;SAI: TX/RX interrupt
        DCD     SAI2_IRQHandler                               ;SAI: TX/RX interrupt
        DCD     XSPI0_IRQHandler                              ;xSPI: Ored interrupt
        DCD     XSPI1_IRQHandler                              ;xSPI: Ored interrupt
        DCD     XSPI2_IRQHandler                              ;xSPI: Ored interrupt
        DCD     MMU0_IRQHandler                               ;MMU: Interrupt request
        DCD     MMU1_IRQHandler                               ;MMU: Interrupt request
        DCD     MMU2_IRQHandler                               ;MMU: Interrupt request
        DCD     Freqme_IRQHandler                             ;FREQME: Interrupt request
        DCD     GDET0_IRQHandler                              ;GDET0: Interrupt request
        DCD     Reserved142_IRQHandler                        ;Reserved interrupt
        DCD     Reserved143_IRQHandler                        ;Reserved interrupt
        DCD     GDET3_IRQHandler                              ;GDET3: Interrupt request
        DCD     CDOG0_IRQHandler                              ;CDOG: Interrupt request
        DCD     CDOG1_IRQHandler                              ;CDOG: Interrupt request
        DCD     CDOG2_IRQHandler                              ;CDOG: Interrupt request
        DCD     ITRC0_IRQHandler                              ;ITRC: Interrupt, cleared by software
        DCD     ELS_IRQHandler                                ;ELS Interrupt request
        DCD     PKC_IRQHandler                                ;PKC: Public Key Cryptography Interrutp
        DCD     OSCCA_IRQHandler                              ;OSCCA: OSCCA Interrupt request
        DCD     SLEEPCON0_IRQHandler                          ;WAKEUP: CPU0 wakeup event
        DCD     CPU0_IRQHandler                               ;CTI0: interrupt request
        DCD     PMC_IRQHandler                                ;PMC: Compute domain Interrupt
        DCD     JPEGDEC_IRQHandler                            ;JPEGDEC: Ored Context 0-3 interrupt request
        DCD     PNGDEC_IRQHandler                             ;PGNDEC: Interrut request
        DCD     NPU_IRQHandler                                ;NPU: Interrupt request
        DCD     TRNG_IRQHandler                               ;TRNG: interrupt
        DCD     TEMPDET0_IRQHandler                           ;TEMPDET0: Interrupt request 0
        DCD     TEMPDET1_IRQHandler                           ;TEMPDET1: Interrupt request 1
        DCD     EZHV_IRQHandler                               ;EZH-V: Interrupt request
        DCD     GLIKEY0_IRQHandler                            ;GLIKEY: Interrupt
        DCD     GLIKEY2_IRQHandler                            ;GLIKEY: Interrupt
        DCD     GLIKEY3_IRQHandler                            ;GLIKEY: Interrupt
        DCD     GLIKEY5_IRQHandler                            ;GLIKEY: Interrupt
        DCD     PVTS0_CPU0_IRQHandler                         ;PVTS0 CPU0 interrupt
        DCD     Reserved167_IRQHandler                        ;Reserved interrupt 167
        DCD     PVTS0_HIFI4_IRQHandler                        ;PVTS0 HIFI4 interrupt
        DCD     Reserved169_IRQHandler                        ;Reserved interrupt 169
        DCD     FRO0_IRQHandler                               ;FRO: 300MHz FRO in VDD2 domain Async interrupt
        DCD     FRO1_IRQHandler                               ;FRO: 192MHz FRO in VDD2 domain Async interrupt
        DCD     FRO2_IRQHandler                               ;FRO: 300MHz FRO in VDD1 domain Async interrupt
        DCD     OCOTP_IRQHandler                              ;OCOTP warning and integrity error interrupt
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

