Masmiseim36/nxpSDK/devices/MIMXRT758S/iar/startup_MIMXRT758S_cm33_core0.s
        PUBWEAK Reserved167_IRQHandler
        PUBWEAK Reserved167_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved167_IRQHandler
        LDR     R0, =Reserved167_DriverIRQHandler
        BX      R0

        PUBWEAK PVTS0_HIFI4_IRQHandler
        PUBWEAK PVTS0_HIFI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PVTS0_HIFI4_IRQHandler
        LDR     R0, =PVTS0_HIFI4_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved169_IRQHandler
        PUBWEAK Reserved169_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved169_IRQHandler
        LDR     R0, =Reserved169_DriverIRQHandler
        BX      R0

        PUBWEAK FRO0_IRQHandler
        PUBWEAK FRO0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FRO0_IRQHandler
        LDR     R0, =FRO0_DriverIRQHandler
        BX      R0

        PUBWEAK FRO1_IRQHandler
        PUBWEAK FRO1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FRO1_IRQHandler
        LDR     R0, =FRO1_DriverIRQHandler
        BX      R0

        PUBWEAK FRO2_IRQHandler
        PUBWEAK FRO2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FRO2_IRQHandler
        LDR     R0, =FRO2_DriverIRQHandler
        BX      R0

        PUBWEAK OCOTP_IRQHandler
        PUBWEAK OCOTP_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
OCOTP_IRQHandler
        LDR     R0, =OCOTP_DriverIRQHandler
        BX      R0

Reserved16_DriverIRQHandler
UTICK0_DriverIRQHandler
MRT0_DriverIRQHandler
CTIMER0_DriverIRQHandler
CTIMER1_DriverIRQHandler
SCT0_DriverIRQHandler
CTIMER3_DriverIRQHandler
LP_FLEXCOMM0_DriverIRQHandler
LP_FLEXCOMM1_DriverIRQHandler
LP_FLEXCOMM2_DriverIRQHandler
LP_FLEXCOMM3_DriverIRQHandler
LP_FLEXCOMM4_DriverIRQHandler
LP_FLEXCOMM5_DriverIRQHandler
LPSPI14_DriverIRQHandler
LPI2C15_DriverIRQHandler
ADC_DriverIRQHandler
SDADC_DriverIRQHandler
ACMP_DriverIRQHandler
PDM_EVENT_DriverIRQHandler
PDM_HWVAD_EVENT_DriverIRQHandler
HYPERVISOR_DriverIRQHandler
SECURE_VIOLATION_DriverIRQHandler
SENSE_HYPERVISOR_DriverIRQHandler
SENSE_SECURE_VIOLATION_DriverIRQHandler
MEDIA_HYPERVISOR_DriverIRQHandler
MEDIA_SECURE_VIOLATION_DriverIRQHandler
RTC0_ALARM_DriverIRQHandler
RTC0_DriverIRQHandler
Reserved44_DriverIRQHandler
MU0_A_DriverIRQHandler
MU1_A_DriverIRQHandler
Reserved47_DriverIRQHandler
CTIMER2_DriverIRQHandler
CTIMER4_DriverIRQHandler
OS_EVENT_DriverIRQHandler
LP_FLEXCOMM6_DriverIRQHandler
LP_FLEXCOMM7_DriverIRQHandler
USDHC0_DriverIRQHandler
USDHC1_DriverIRQHandler
I3C0_DriverIRQHandler
USB0_DriverIRQHandler
USB1_DriverIRQHandler
WDT0_DriverIRQHandler
WDT1_DriverIRQHandler
USBPHY0_DriverIRQHandler
PUF_DriverIRQHandler
Reserved62_DriverIRQHandler
LP_FLEXCOMM8_DriverIRQHandler
LP_FLEXCOMM9_DriverIRQHandler
LP_FLEXCOMM10_DriverIRQHandler
LP_FLEXCOMM11_DriverIRQHandler
LP_FLEXCOMM12_DriverIRQHandler
LP_FLEXCOMM13_DriverIRQHandler
LPSPI16_DriverIRQHandler
I3C1_DriverIRQHandler
FLEXIO_DriverIRQHandler
LCDIF_DriverIRQHandler
VGPU_DriverIRQHandler
MIPI_DriverIRQHandler
EDMA0_CH0_DriverIRQHandler
EDMA0_CH1_DriverIRQHandler
EDMA0_CH2_DriverIRQHandler
EDMA0_CH3_DriverIRQHandler
EDMA0_CH4_DriverIRQHandler
EDMA0_CH5_DriverIRQHandler
EDMA0_CH6_DriverIRQHandler
EDMA0_CH7_DriverIRQHandler
EDMA0_CH8_DriverIRQHandler
EDMA0_CH9_DriverIRQHandler
EDMA0_CH10_DriverIRQHandler
EDMA0_CH11_DriverIRQHandler
EDMA0_CH12_DriverIRQHandler
EDMA0_CH13_DriverIRQHandler
EDMA0_CH14_DriverIRQHandler
EDMA0_CH15_DriverIRQHandler
EDMA1_CH0_DriverIRQHandler
EDMA1_CH1_DriverIRQHandler
EDMA1_CH2_DriverIRQHandler
EDMA1_CH3_DriverIRQHandler
EDMA1_CH4_DriverIRQHandler
EDMA1_CH5_DriverIRQHandler
EDMA1_CH6_DriverIRQHandler
EDMA1_CH7_DriverIRQHandler
EDMA1_CH8_DriverIRQHandler
EDMA1_CH9_DriverIRQHandler
EDMA1_CH10_DriverIRQHandler
EDMA1_CH11_DriverIRQHandler
EDMA1_CH12_DriverIRQHandler
EDMA1_CH13_DriverIRQHandler
EDMA1_CH14_DriverIRQHandler
EDMA1_CH15_DriverIRQHandler
GPIO00_DriverIRQHandler
GPIO01_DriverIRQHandler
GPIO10_DriverIRQHandler
GPIO11_DriverIRQHandler
GPIO20_DriverIRQHandler
GPIO21_DriverIRQHandler
GPIO30_DriverIRQHandler
GPIO31_DriverIRQHandler
GPIO40_DriverIRQHandler
GPIO41_DriverIRQHandler
GPIO50_DriverIRQHandler
GPIO51_DriverIRQHandler
GPIO60_DriverIRQHandler
GPIO61_DriverIRQHandler
GPIO70_DriverIRQHandler
GPIO71_DriverIRQHandler
PIN_INT0_DriverIRQHandler
PIN_INT1_DriverIRQHandler
PIN_INT2_DriverIRQHandler
PIN_INT3_DriverIRQHandler
PIN_INT4_DriverIRQHandler
PIN_INT5_DriverIRQHandler
PIN_INT6_DriverIRQHandler
PIN_INT7_DriverIRQHandler
SAI0_DriverIRQHandler
SAI1_DriverIRQHandler
SAI2_DriverIRQHandler
XSPI0_DriverIRQHandler
XSPI1_DriverIRQHandler
XSPI2_DriverIRQHandler
MMU0_DriverIRQHandler
MMU1_DriverIRQHandler
MMU2_DriverIRQHandler
Freqme_DriverIRQHandler
GDET0_DriverIRQHandler
Reserved142_DriverIRQHandler
Reserved143_DriverIRQHandler
GDET3_DriverIRQHandler
CDOG0_DriverIRQHandler
CDOG1_DriverIRQHandler
CDOG2_DriverIRQHandler
ITRC0_DriverIRQHandler
ELS_DriverIRQHandler
PKC_DriverIRQHandler
OSCCA_DriverIRQHandler
SLEEPCON0_DriverIRQHandler
CPU0_DriverIRQHandler
PMC_DriverIRQHandler
JPEGDEC_DriverIRQHandler
PNGDEC_DriverIRQHandler
NPU_DriverIRQHandler
TRNG_DriverIRQHandler
TEMPDET0_DriverIRQHandler
TEMPDET1_DriverIRQHandler
EZHV_DriverIRQHandler
GLIKEY0_DriverIRQHandler
GLIKEY2_DriverIRQHandler
GLIKEY3_DriverIRQHandler
GLIKEY5_DriverIRQHandler
PVTS0_CPU0_DriverIRQHandler
Reserved167_DriverIRQHandler
PVTS0_HIFI4_DriverIRQHandler
Reserved169_DriverIRQHandler
FRO0_DriverIRQHandler
FRO1_DriverIRQHandler
FRO2_DriverIRQHandler
OCOTP_DriverIRQHandler
DefaultISR
        B .

        END
